// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   IpConfigStrings.uni
// 
// Abstract: 
// 
//   String definitions for the Shell ipconfig command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"


#string STR_IPCONFIG_MAC_ADDRESS       #language eng  "MAC Address: "

#string STR_IPCONFIG_ONE_VAR           #language eng  "%02x "

#string STR_IPCONFIG_BROADCAST         #language eng  "Broadcast MAC: "

#string STR_IPCONFIG_SET_IP            #language eng  "%Hipconfig%N: Set IP address error - %r\n"

#string STR_IPCONFIG_IP_ADDRESS        #language eng  "IP Address: %d.%d.%d.%d\n"

#string STR_IPCONFIG_IP_MASK           #language eng  "IP Mask: %d.%d.%d.%d\n"

#string STR_IPCONFIG_INVALID_PXE       #language eng  "%Hipconfig%N: Invalid PXE BaseCode protocol pointer\n"

#string STR_IPCONFIG_STOP_PXE          #language eng  "%Hipconfig%N: Stop PXE BaseCode error - %r\n"

#string STR_IPCONFIG_START_PXE         #language eng  "%Hipconfig%N: Start PXE BaseCode error - %r\n"

#string STR_IPCONFIG_DHCP              #language eng  "%Hipconfig%N: DHCP start error - %r\n"

#string STR_IPCONFIG_INS_NOT_SUPPORT   #language eng  "%Hipconfig%N: Instance %d is too big.\n"

#string STR_IPCONFIG_INVALID_ARG       #language eng  "%Hipconfig%N: Invalid argument - '%hs'.\n"

#string STR_IPCONFIG_LINEHELP #language eng  "Displays or modifies the IP configuration"

#string STR_IPCONFIG_VERBOSEHELP #language eng "Displays or modifies the IP configuration of PXE BaseCode protocol mode.\n"
                                                      "\n"
                                                      "IPCONFIG [-r]|[-b] [-c Instance] [IpAddress [-m NetMask]]\n"
                                                      "\n"
                                                      "    -r          - Restarts the PXE base code and DHCP settings\n"
                                                      "    -b          - Displays one screen at a time\n"
                                                      "    Instance    - Specifies the instance of Simple Network Protocol, 0 based\n"
                                                      "    IpAddress   - IP address of a.b.c.d form\n"
                                                      "    NetMask     - Network mask of 255.255.255.0 form\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the current IP configuration:\n"
                                                      "    Shell:\\> IpConfig\n"
                                                      "\n"
                                                      "  * To restart PXE base code and refresh DHCP settings:\n"
                                                      "    shell:\\> IpConfig -r\n"
                                                      "\n"
                                                      "  * To modify IP adress without network mask change:\n"
                                                      "    shell:\\> IpConfig 192.168.10.30\n"
                                                      "\n"
                                                      "  * To modify the IP adress and network mask:\n"
                                                      "    shell:\\> IpConfig 192.168.10.30 -m 255.255.255.0\n"
